src/cf/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстройствоРаспознавания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблачнаяККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Несертифицируемое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПодключаемогоОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Comment>Предназначен для обмена с оборудованием Offline</Comment>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяФискализация</Name>
					<Comment>Автоматическая фискализация чеков из очереди чеков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяФН36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОтраслевыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользовательБПО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПалитраТоваровРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПалитраТоваровРМК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВРяду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРядов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтЭлементовПодбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаполненияПалитрыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяОсобенностьУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОсобенностиУчетаНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаНаНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаПапки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоКатегория</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегории</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегорииРазмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзображениеЭлемента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМКПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шрифт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветШрифта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияРазмещения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АльтернативнаяГруппировкаИзбранныхТоваровРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмеетсяВложенность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМодификатора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМодификаторовРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкрыватьОстаток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Палитра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустаяОбласть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартинкаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбновлениеИнформационнойБазыРМК/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "БиблиотекаРабочегоМестаКассира";
	Описание.Версия = ОбщегоНазначенияРМК.ВерсияБиблиотеки();
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно".
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.7.128";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаполнитьСпособПечатиТоварногоЧека";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.8.42";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакиВидовОплатВНастройкахРМК";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.9.17";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ПеренестиБыстрыеТоварыИзНастроекВПалитруТоваров";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.10.21";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаменитьКомандуОткрытияДенежногоЯщикаВГорячихКлавишах";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.12.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакиВидовОплатВНастройкахРМК_ПС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.13.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьПризнакОплатыПлатежнымиКартами";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.14.9";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьРежимНачальнойСтраницы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.15.29";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.СформироватьПервоначальныйКонтрольПродаж";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.15.80";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ОбновитьВложенныеПалитрыНастроек";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.16.12";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыРМК.ЗаполнитьЦветаПалитрыПоУмолчанию";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример:
//  // Пример обхода выполненных обработчиков обновления:
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
 
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  // Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику".
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
 
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
 
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
	
	Параметры.ОбъектыСНачальнымЗаполнением.Добавить(Метаданные.Справочники.ВидыКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСпособПечатиТоварногоЧека() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Настройки
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ПО НастройкиРабочегоМестаКассира.РабочееМесто = ПодключаемоеОборудование.РабочееМесто
	|ГДЕ
	|	НастройкиРабочегоМестаКассира.ПометкаУдаления
	|	И ЕСТЬNULL(ПодключаемоеОборудование.ТипОборудования, ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПринтерЧеков)
	|	И ЕСТЬNULL(ПодключаемоеОборудование.УстройствоИспользуется, ЛОЖЬ)
	|	И НЕ ЕСТЬNULL(ПодключаемоеОборудование.ПометкаУдаления, ЛОЖЬ)");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Настройки);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Выборка.Настройки.ПолучитьОбъект();
			СправочникОбъект.СпособФормированияТоварногоЧека = 2;
			СправочникОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при изменении данных справочника.'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.Настройки,
				,
				ТекстСообщения);
				
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакиВидовОплатВНастройкахРМК_ПС() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбъектНастройкаРМК.ИспользоватьОплатуПлатежнымиСистемами = Истина;
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настройки РМК ""Использовать оплату платежными системами""'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакиВидовОплатВНастройкахРМК() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			ОбъектНастройкаРМК.ИспользоватьОплатуНаличными = Истина;
			
			ОбщегоНазначенияРМКПереопределяемый.ОбновитьНастройкиПризнаковВидовОплат(ОбъектНастройкаРМК);
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиБыстрыеТоварыИзНастроекВПалитруТоваров() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираБыстрыеТовары.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.БыстрыеТовары КАК НастройкиРабочегоМестаКассираБыстрыеТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиРабочегоМестаКассираБыстрыеТовары.Ссылка");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НастройкаРМК.БыстрыеТовары.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			БыстрыеТовары = ОбъектНастройкаРМК.БыстрыеТовары;
			
			НоваяПалитра = Справочники.ПалитраТоваровРМК.СоздатьЭлемент();
			НоваяПалитра.Наименование = НСтр("ru = 'Палитра быстрых товаров'");
			НоваяПалитра.ШрифтЭлементовПодбора = ОбщегоНазначения.ЗначениеВСтрокуXML(ШрифтыСтиля.ШрифтОбычныйПолужирный12РМК);
			НоваяПалитра.КоличествоЭлементовВРяду = 4;
			НоваяПалитра.КоличествоРядов = 3;
			НоваяПалитра.ВысотаЭлемента = 5;
			
			СоставПалитры = НоваяПалитра.Состав;
			
			Для Каждого СтрокаТовара Из БыстрыеТовары Цикл
				
				СтрокаПалитры = СоставПалитры.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПалитры, СтрокаТовара);
				СтрокаПалитры.ИндексПозиции = СтрокаТовара.НомерСтроки;
				
				СтрокаПалитры.ХарактеристикиИспользуются =
					ОбщегоНазначенияРМК.ТребуетсяВводХарактеристикиДляНоменклатуры(СтрокаПалитры.Номенклатура);
				
				Если ЗначениеЗаполнено(СтрокаПалитры.Характеристика) Тогда
					СтрокаПалитры.ИмяЭлемента = СтрШаблон(НСтр("ru = '%1 %2'"), СтрокаПалитры.Номенклатура, СтрокаПалитры.Характеристика);
				Иначе
					СтрокаПалитры.ИмяЭлемента = СтрШаблон(НСтр("ru = '%1'"), СтрокаПалитры.Номенклатура);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(СтрокаТовара.ЦветФона) Тогда
					СтрокаПалитры.ЦветФона = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветАктивнойКнопкиРМК);
				КонецЕсли;
				
				СтрокаПалитры.ЦветШрифта = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Цвет(0, 0, 0));
				СтрокаПалитры.Шрифт = НоваяПалитра.ШрифтЭлементовПодбора;
				
			КонецЦикла;
			
			НоваяПалитра.Записать();
			
			ОбъектНастройкаРМК.СтруктураБыстрыхТоваров = НоваяПалитра.Ссылка;
			ОбъектНастройкаРМК.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьКомандуОткрытияДенежногоЯщикаВГорячихКлавишах() Экспорт
	
	ИмяСтаройКнопки = "ОткрытьДенежныйЯщикПриВыдачеНаличных";
	ИмяНовойКнопки = "ОткрытьДенежныйЯщик";
	
	ЗапросНастроекРМК = Новый Запрос;
	ЗапросНастроекРМК.Текст = 
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира.ГорячиеКлавиши КАК НастройкиРабочегоМестаКассираГорячиеКлавиши
	|ГДЕ
	|	НастройкиРабочегоМестаКассираГорячиеКлавиши.ИмяКнопки = &ИмяСтаройКнопки";
	ЗапросНастроекРМК.УстановитьПараметр("ИмяСтаройКнопки", ИмяСтаройКнопки);
	
	ВыборкаНастроекРМК = ЗапросНастроекРМК.Выполнить().Выбрать();
	Пока ВыборкаНастроекРМК.Следующий() Цикл
		НастройкаРМКОбъект = ВыборкаНастроекРМК.НастройкаРМК.ПолучитьОбъект();
		СтрокаНовойКнопки = НастройкаРМКОбъект.ГорячиеКлавиши.Найти(ИмяНовойКнопки, "ИмяКнопки");
		СтрокаСтаройКнопки = НастройкаРМКОбъект.ГорячиеКлавиши.Найти(ИмяСтаройКнопки, "ИмяКнопки");
		Если СтрокаНовойКнопки = Неопределено Тогда
			СтрокаСтаройКнопки.ИмяКнопки = ИмяНовойКнопки;
		Иначе
			НастройкаРМКОбъект.ГорячиеКлавиши.Удалить(СтрокаСтаройКнопки);
		КонецЕсли;
		НастройкаРМКОбъект.ОбменДанными.Загрузка = Истина;
		НастройкаРМКОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакОплатыПлатежнымиКартами() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			
			ОбщегоНазначенияРМКПереопределяемый.ОбновитьПризнакОплатыПлатежнымиКартами(ОбъектНастройкаРМК);
			
			ОбъектНастройкаРМК.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьРежимНачальнойСтраницы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК НастройкаРМК
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиРабочегоМестаКассира");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.НастройкаРМК);
			Блокировка.Заблокировать();
			
			ОбъектНастройкаРМК = Выборка.НастройкаРМК.ПолучитьОбъект();
			Если ОбъектНастройкаРМК.УдалитьОсновнойПодборПлиточный Тогда
				ОбъектНастройкаРМК.РежимНачальнойСтраницы = 2;
				ОбъектНастройкаРМК.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
			ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИмяСобытия = НСтр("ru = 'Ошибка при обновлении настроек РМК'", КодОсновногоЯзыка);
			ЗаписьЖурналаРегистрации(ИмяСобытия,
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.НастройкаРМК,
				,
				ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьПервоначальныйКонтрольПродаж() Экспорт
	
	ГУИДКонтрольПродажЗапретОплатыБонусами = Новый УникальныйИдентификатор("db74ecfe-14f4-4dc8-96dd-874c74a41b3d");
	ГУИДКонтрольПродажПроверкаВозраста18 = Новый УникальныйИдентификатор("e5286376-1454-4613-8e78-a2b74266920a");
	
	СтруктураСлужебныхПалитр = ОбщегоНазначенияРМК.ПодготовитьСлужебныеПалитрыДляКонтроляПродаж();
	
	ВидКонтроляЗапретОплатыБонусами = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтроля.ЗапретОплатыБонусами");
	Если ВидКонтроляЗапретОплатыБонусами = Неопределено
			Или Не ЗначениеЗаполнено(ВидКонтроляЗапретОплатыБонусами.ТипКонтроля) Тогда
		ОбщегоНазначенияРМК.ЗаполнитьВидКонтроляЗапретОплатыБонусами(ВидКонтроляЗапретОплатыБонусами);
		Константы.ИспользоватьКонтрольПродаж.Установить(Истина);
	КонецЕсли;
	
	КонтрольПродажЗапретОплатыБонусами
		= Справочники.КонтрольПродаж.ПолучитьСсылку(ГУИДКонтрольПродажЗапретОплатыБонусами);
	Если Не (ОбщегоНазначения.СсылкаСуществует(КонтрольПродажЗапретОплатыБонусами)
			Или СтруктураСлужебныхПалитр.ПалитраЗапретаОплатыБонусами = Неопределено) Тогда
		ОбщегоНазначенияРМК.ЗаполнитьКонтрольПродажЗапретОплатыБонусами(КонтрольПродажЗапретОплатыБонусами,
			СтруктураСлужебныхПалитр);
	КонецЕсли;
	
	КонтрольПродажПроверкаВозраста18 = Справочники.КонтрольПродаж.ПолучитьСсылку(ГУИДКонтрольПродажПроверкаВозраста18);
	Если Не (ОбщегоНазначения.СсылкаСуществует(КонтрольПродажПроверкаВозраста18)
			Или СтруктураСлужебныхПалитр.ПалитраПроверкиВозраста = Неопределено) Тогда
		ОбщегоНазначенияРМК.ЗаполнитьКонтрольПродажПроверкаВозраста18(КонтрольПродажПроверкаВозраста18,
			СтруктураСлужебныхПалитр);
	КонецЕсли;
	
	Если ОбщегоНазначенияРМК.ИспользоватьЗапретыПродаж() Тогда
		ОбщегоНазначенияРМК.СоздатьКонтрольПродажПоДаннымРегистраЗапретовПродаж();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВложенныеПалитрыНастроек() Экспорт
	
	ЗапросНастроекСПалитрами = Новый Запрос;
	ЗапросНастроекСПалитрами.Текст =
	"ВЫБРАТЬ
	|	НастройкиРабочегоМестаКассира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК НастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ(НастройкиРабочегоМестаКассира.СтруктураПлиточногоИнтерфейсаПодбора = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка)
	|				И НастройкиРабочегоМестаКассира.СтруктураБыстрыхТоваров = ЗНАЧЕНИЕ(Справочник.ПалитраТоваровРМК.ПустаяСсылка))
	|	И НЕ НастройкиРабочегоМестаКассира.ПометкаУдаления";
	
	РезультатЗапроса = ЗапросНастроекСПалитрами.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			АктуализироватьСписокПалитр(НастройкаОбъект, "СтруктураПлиточногоИнтерфейсаПодбора", "ПалитрыПлиточныйИнтерфейс");
			АктуализироватьСписокПалитр(НастройкаОбъект, "СтруктураБыстрыхТоваров", "ПалитрыИзбранное");
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.Записать();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура АктуализироватьСписокПалитр(НастройкаОбъект, ИмяРеквизита, ИмяТабличнойЧасти)
	
	НастройкаОбъект[ИмяТабличнойЧасти].Очистить();
	Если ЗначениеЗаполнено(НастройкаОбъект[ИмяРеквизита]) Тогда
		ИсходныйМассив = Новый Массив;
		ИсходныйМассив.Добавить(НастройкаОбъект[ИмяРеквизита]);
		ПодчиненныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(ИсходныйМассив);
		ПалитрыПризнакСлужебная = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ПодчиненныеПалитры, "Служебная");
		НоваяСтрока = НастройкаОбъект[ИмяТабличнойЧасти].Добавить();
		НоваяСтрока.Палитра = НастройкаОбъект[ИмяРеквизита];
		Для Каждого ПалитраСПризнаком Из ПалитрыПризнакСлужебная Цикл
			Если Не ПалитраСПризнаком.Значение Тогда
				НоваяСтрока = НастройкаОбъект[ИмяТабличнойЧасти].Добавить();
				НоваяСтрока.Палитра = ПалитраСПризнаком.Ключ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимоОбновитьПалитру(ПалитраСсылка, ЦветаПалитры)
	
	РезультатФункции = Ложь;
	
	Если СокрЛП(ПалитраСсылка.ЦветФонаКнопки) = "" Или СокрЛП(ПалитраСсылка.ЦветФонаПапки) = "" Тогда
		РезультатФункции = Истина;
	Иначе
		КоличествоСтрок = ПалитраСсылка.Состав.Количество();
		ИндексСтроки = 0;
		Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
			СтрокаСостава = ПалитраСсылка.Состав.Получить(ИндексСтроки);
			Если ЗначениеЗаполнено(СтрокаСостава.Номенклатура)
				И СтрокаСостава.ЦветФона = ЦветаПалитры.ЦветФонаКнопкиУстаревшийСтрокой Тогда
				
				РезультатФункции = Истина;
				
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура ОбновитьЦветаПалитрыЗначениямиПоУмолчанию(ПалитраСсылка, ЦветаПалитры)
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ПалитраТоваровРМК");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ПалитраСсылка);
		Блокировка.Заблокировать();
		
		ПалитраОбъект = ПалитраСсылка.ПолучитьОбъект();
		
		Если СокрЛП(ПалитраОбъект.ЦветФонаКнопки) = "" Тогда
			ПалитраОбъект.ЦветФонаКнопки = ЦветаПалитры.ЦветФонаКнопкиСтрокой;
		КонецЕсли;
		Если СокрЛП(ПалитраОбъект.ЦветФонаПапки) = "" Тогда
			ПалитраОбъект.ЦветФонаПапки = ЦветаПалитры.ЦветФонаПапкиСтрокой;
		КонецЕсли;
		Для Каждого СтрокаСостава Из ПалитраОбъект.Состав Цикл
			
			Если ЗначениеЗаполнено(СтрокаСостава.Номенклатура)
				И СтрокаСостава.ЦветФона = ЦветаПалитры.ЦветФонаКнопкиУстаревшийСтрокой Тогда
				
				СтрокаСостава.ЦветФона = ЦветаПалитры.ЦветФонаКнопкиСтрокой;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПалитраОбъект.ОбменДанными.Загрузка = Истина;
		ПалитраОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		ТекстСообщения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИмяСобытия = НСтр("ru = 'Ошибка при обновлении палитры РМК'", КодОсновногоЯзыка);
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			ПалитраСсылка,
			,
			ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьЦветаПалитрыПоУмолчанию() Экспорт
	
	ЦветаПалитры = Новый Структура();
	
	ЦветФонаКнопкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветФонаСтаканаРМК);
	ЦветФонаПапкиСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветПапкиКнопкиРМК);
	ЦветФонаКнопкиУстаревшийСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ЦветаСтиля.ЦветАктивнойКнопкиРМК);
	
	ЦветаПалитры.Вставить("ЦветФонаКнопкиСтрокой", ЦветФонаКнопкиСтрокой);
	ЦветаПалитры.Вставить("ЦветФонаПапкиСтрокой", ЦветФонаПапкиСтрокой);
	ЦветаПалитры.Вставить("ЦветФонаКнопкиУстаревшийСтрокой", ЦветФонаКнопкиУстаревшийСтрокой);
	
	ЗапросПалитр = Новый Запрос;
	ЗапросПалитр.Текст =
	"ВЫБРАТЬ
	|	ПалитраТоваровРМК.Ссылка КАК Палитра
	|ИЗ
	|	Справочник.ПалитраТоваровРМК КАК ПалитраТоваровРМК";
	
	РезультатЗапроса = ЗапросПалитр.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПалитр = РезультатЗапроса.Выбрать();
		Пока ВыборкаПалитр.Следующий() Цикл
			
			ПалитраСсылка = ВыборкаПалитр.Палитра;
			Если НеобходимоОбновитьПалитру(ПалитраСсылка, ЦветаПалитры) Тогда
				
				ОбновитьЦветаПалитрыЗначениямиПоУмолчанию(ПалитраСсылка, ЦветаПалитры);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
